xiaothinking/STM32F407HALStudy/IAP/stm32f407_hal_bootloader/stm32f407bootloader/Core/Inc/stmflash.h
#ifndef __STMFLASH_H
#define __STMFLASH_H
#include "stm32f4xx_hal.h"



typedef  void (*iapfun)(void);				//定义一个函数类型的参数.

#define  APP_START_ADDRESS         0x8020000
#define  UPGRADE_START_ADDRESS     0x8040000
#define  UPGRATDE_SIGN_ADDRESS     0x8060000

extern void iap_load_app(uint32_t appxaddr);
extern void Copy_Bin_Data_To_App(uint32_t Dest_Addr,uint32_t Source_Addr, uint32_t _Lenth);	

//FLASH起始地址
#define STM32_FLASH_BASE 0x08000000 	//STM32 FLASH的起始地址
#define FLASH_WAITETIME  50000          //FLASH等待超时时间

//FLASH 扇区的起始地址
#define ADDR_FLASH_SECTOR_0     ((uint32_t)0x08000000) 	//扇区0起始地址, 16 Kbytes  
#define ADDR_FLASH_SECTOR_1     ((uint32_t)0x08004000) 	//扇区1起始地址, 16 Kbytes  
#define ADDR_FLASH_SECTOR_2     ((uint32_t)0x08008000) 	//扇区2起始地址, 16 Kbytes  
#define ADDR_FLASH_SECTOR_3     ((uint32_t)0x0800C000) 	//扇区3起始地址, 16 Kbytes  
#define ADDR_FLASH_SECTOR_4     ((uint32_t)0x08010000) 	//扇区4起始地址, 64 Kbytes  
#define ADDR_FLASH_SECTOR_5     ((uint32_t)0x08020000) 	//扇区5起始地址, 128 Kbytes  
#define ADDR_FLASH_SECTOR_6     ((uint32_t)0x08040000) 	//扇区6起始地址, 128 Kbytes  
#define ADDR_FLASH_SECTOR_7     ((uint32_t)0x08060000) 	//扇区7起始地址, 128 Kbytes  
#define ADDR_FLASH_SECTOR_8     ((uint32_t)0x08080000) 	//扇区8起始地址, 128 Kbytes  
#define ADDR_FLASH_SECTOR_9     ((uint32_t)0x080A0000) 	//扇区9起始地址, 128 Kbytes  
#define ADDR_FLASH_SECTOR_10    ((uint32_t)0x080C0000) 	//扇区10起始地址,128 Kbytes  
#define ADDR_FLASH_SECTOR_11    ((uint32_t)0x080E0000) 	//扇区11起始地址,128 Kbytes 

 
uint32_t STMFLASH_GetFlashSector(uint32_t _num); 
void STMFLASH_EraseSec(uint32_t Start_Sector,uint32_t End_Sector);
uint8_t STMFLASH_Write(uint32_t WriteAddr,uint8_t *pBuffer,uint16_t NumToWrite);

uint8_t STMFLASH_ReadByte(uint32_t faddr);
uint32_t STMFLASH_ReadWord(uint32_t faddr);
void STMFLASH_Read(uint32_t ReadAddr,uint8_t *pBuffer,uint16_t NumToRead);  


#endif
